JBHarvey/design-iii/src/stm32/dev/src/main.c
/**
 *    USB VCP for STM32F4xx example.
 *
 *    @author     Tilen Majerle
 *    @email        tilen@majerle.eu
 *    @website    http://stm32f4-discovery.com
 *    @ide        Keil uVision
 *
 * Add line below to use this example with F429 Discovery board (in defines.h file)
 *
 * #define USE_USB_OTG_HS
 */
#include <motor.h>
#include <PID_v1.h>
#include "tm_stm32f4_usb_vcp.h"
#include "tm_stm32f4_disco.h"
#include "defines.h"
#include "stm32f4xx.h"
#include "stm32f4_discovery.h"
#include "stm32f4xx_exti.h"
#include "stm32f4xx_syscfg.h"
#include "misc.h"
#include "tm_stm32f4_gpio.h"
#include "tm_stm32f4_hd44780.h"
#include "tm_stm32f4_delay.h"
#include "manchester.h"
#include "encoder.h"
#include "externalInterrupts.h"
#include "timers.h"
#include "pushButtons.h"
#include "leds.h"

#define TAILLE 500

enum State {
	IDLE,
	GENERATE_FIRST_PWM,
	BETWEEN_PWM,
	ACQUIRE,
	SEND_DATA,
	WAIT_FOR_SECOND_PWM
};

enum MainState {
	MAIN_IDLE,
	MAIN_MANCH,
	MAIN_ACQUIS,
	MAIN_ACQUIS_ALL,
	MAIN_TEST_SPEED_PID,
	MAIN_DEAD_ZONE,
	MAIN_MOVE,
	MAIN_PID
};

enum SpeedDirection {
	SPEED_DIRECTION_FORWARD, SPEED_DIRECTION_BACKWARD, SPEED_DIRECTION_NONE
};

enum AmountOfCharacters {
	ONE_CHARACTER, MANY_CHARACTERS
};

enum COMMUNICATION_STATUS {
	READ_USB_SUCCESS, READ_USB_FAIL
};

enum COMMAND {
	COMMAND_MOVE
};

#define INTERNAL_SYSTICK_FREQUENCY 500
#define TIME_DELAY 1/(float) INTERNAL_SYSTICK_FREQUENCY
#define MAX_SPEED_INDEX 2000
#define TICKS_BUFFER_SIZE 100
#define MAXIMUM_CHARACTERS_BUFFER_SIZE 100

// buffer ticks for debug
volatile int ticksIndex4 = 0;
volatile int ticksBuffer4[TICKS_BUFFER_SIZE];

// Variables avec le nombre de Ticks pour la vitesse
volatile int numberOfSpeedEdges1 = 0;
volatile int numberOfSpeedEdges2 = 0;
volatile int numberOfSpeedEdges3 = 0;
volatile int numberOfSpeedEdges4 = 0;

// Variables avec le nombre de Ticks pour la position
volatile int numberOfPositionEdges1 = 0;
volatile int numberOfPositionEdges2 = 0;
volatile int numberOfPositionEdges3 = 0;
volatile int numberOfPositionEdges4 = 0;

// speed direction variables
volatile int speedDirection1 = SPEED_DIRECTION_NONE;
volatile int speedDirection2 = SPEED_DIRECTION_NONE;
volatile int speedDirection3 = SPEED_DIRECTION_NONE;
volatile int speedDirection4 = SPEED_DIRECTION_NONE;

// Initialization of speed motor variables
volatile int speedMotor1 = 0;
volatile int speedMotor2 = 0;
volatile int speedMotor3 = 0;
volatile int speedMotor4 = 0;

volatile int speedIndex = 0;
volatile uint16_t speedBuffer[MAX_SPEED_INDEX];

/***************************************************
 *  Les buffers qui suivent servent à l'acquisition pour
 * bien faire l'asservissement des roues
 ***************************************************/
#define ACQUIS
#define MAX_WHEEL_INDEX 1000
#define PREMIER_ECHELON 40
#define DEUXIEME_ECHELON 80
#define DUREE_ECHELON_1 2000
#define DUREE_ECHELON_2 2000
volatile uint16_t bufferWheelIndex1 = 0;
volatile uint16_t bufferWheelIndex2 = 0;
volatile uint16_t bufferWheelIndex3 = 0;
volatile uint16_t bufferWheelIndex4 = 0;
volatile uint16_t bufferWheel1[MAX_WHEEL_INDEX];
volatile uint16_t bufferWheel2[MAX_WHEEL_INDEX];
volatile uint16_t bufferWheel3[MAX_WHEEL_INDEX];
volatile uint16_t bufferWheel4[MAX_WHEEL_INDEX];

/******************************************************
 * Variables pour tester le PID de vitesse
 * ****************************************************/
#define TEST_SPEED_PID
#ifdef TEST_SPEED_PID
#define PID_SPEED
#define MAX_SPEED_PID_INDEX 500
#define CONSIGNE_SPEED 0.2
volatile uint16_t bufferSpeedPIDIndex1 = 0;
volatile uint16_t bufferSpeedPIDIndex2 = 0;
volatile uint16_t bufferSpeedPIDIndex3 = 0;
volatile uint16_t bufferSpeedPIDIndex4 = 0;
volatile uint16_t bufferSpeedPID1[MAX_SPEED_PID_INDEX];
volatile uint16_t bufferSpeedPID2[MAX_SPEED_PID_INDEX];
volatile uint16_t bufferSpeedPID3[MAX_SPEED_PID_INDEX];
volatile uint16_t bufferSpeedPID4[MAX_SPEED_PID_INDEX];
#endif

/********************************************************
 * Variables pour trouver la zone morte de chacune des roues
 ********************************************************/
#define FIND_DEAD_ZONE
#ifdef FIND_DEAD_ZONE
#define DEAD_START_PWM 20
#define DEAD_STOP_PWM 100
#define MAX_DEAD_ZONE 100
volatile uint8_t bufferDeadZoneIndex1 = 0;
volatile uint8_t bufferDeadZoneIndex2 = 0;
volatile uint8_t bufferDeadZoneIndex3 = 0;
volatile uint8_t bufferDeadZoneIndex4 = 0;
volatile uint16_t bufferDeadZone1[MAX_DEAD_ZONE];
volatile uint16_t bufferDeadZone2[MAX_DEAD_ZONE];
volatile uint16_t bufferDeadZone3[MAX_DEAD_ZONE];
volatile uint16_t bufferDeadZone4[MAX_DEAD_ZONE];
#endif

// declaration of pids
PidType PID_SPEED1;
PidType PID_SPEED2;
PidType PID_SPEED3;
PidType PID_SPEED4;

PidType PID_POSITION1;
PidType PID_POSITION2;
PidType PID_POSITION3;
PidType PID_POSITION4;

// Buffer contenant tous les bits du manchester
volatile uint8_t manchesterBuffer[MANCHESTER_BUFFER_LENGTH];
volatile uint8_t manchesterIndex = 0;
volatile uint8_t manchesterState = MANCHESTER_WAIT_FOR_DECODING;
volatile uint8_t manchesterFigureVerification = 0;
volatile char manchesterOrientationVerification[ORIENTATION_LENGTH] = { ' ',
		' ', ' ', ' ', ' ' };
volatile uint8_t manchesterFactorVerification = 0;

extern void TIM5_IRQHandler() {
	if (TIM_GetITStatus(TIM5, TIM_IT_Update) != RESET) {
		TIM_ClearITPendingBit(TIM5, TIM_IT_Update);

		switch (manchesterState) {
		case MANCHESTER_FIRST:
			//GPIO_ToggleBits(GPIOD, GPIO_Pin_12);
			manchesterIndex = 0;
			manchesterState = MANCHESTER_FILL;
			TIM_SetAutoreload(TIM5, MANCHESTER_PERIOD * 4 - 1);
			break;
		case MANCHESTER_FILL:
			//GPIO_ToggleBits(GPIOD, GPIO_Pin_13);
			manchesterBuffer[manchesterIndex] = GPIO_ReadInputDataBit(GPIOD,
					MANCHESTER_PIN);
			manchesterIndex++;
			if (manchesterIndex >= MANCHESTER_BUFFER_LENGTH)
				manchesterState = MANCHESTER_DECODE;
			break;
		}
	}
}

void cleanNumberString(char *numberString, int size) {
	int arrayPosition = size - 1;
	while (numberString[arrayPosition] != 0) {
		numberString[arrayPosition] = ' ';
		arrayPosition--;
	}

	while (numberString[arrayPosition] == 0) {
		numberString[arrayPosition] = ' ';
		arrayPosition--;
	}
	numberString[size - 1] = 0;
}

/* Change the state of the main
 * IN : the new state
 */
void setState(int* state, int newState) {
	switch (newState) {
	case MAIN_IDLE:
		*state = newState;
		TM_HD44780_Puts(0, 0, MSG_IDLE);
		break;
	case MAIN_MANCH:
		*state = newState;
		TM_HD44780_Puts(0, 0, MSG_MANCH);
		break;
	case MAIN_ACQUIS:
		TM_HD44780_Puts(0, 0, "NOT IMPLEMENTED");
		break;
	case MAIN_MOVE:
		*state = MAIN_MOVE;
		TM_HD44780_Puts(0, 0, "MOVE");
		break;
	case MAIN_PID:
		*state = newState;
		TM_HD44780_Puts(0, 0, "NOT IMPLEMENTED");
		break;
	default:
		// Invalid state
		TM_HD44780_Puts(0, 0, MSG_ERR);
		break;
	}
}

/* frequency is in hertz*/
void systickInit(uint16_t frequency) {
	NVIC_SetPriority(SysTick_IRQn, 0);
	RCC_ClocksTypeDef RCC_Clocks;
	RCC_GetClocksFreq(&RCC_Clocks);
	(void) SysTick_Config(RCC_Clocks.HCLK_Frequency / frequency);

