JBHarvey/design-iii/src/stm32/dev/src/main.c
}

void generateFirstPWM() {
	MotorSetSpeed(1, 40);
}

void generateSecondPWM() {
	MotorSetSpeed(1, 90);
}

void startFillingBuffer() {
	systickInit(INTERNAL_SYSTICK_FREQUENCY);
}

uint8_t readUSB() {
	/* USB configured OK, drivers OK */
	if (TM_USB_VCP_GetStatus() == TM_USB_VCP_CONNECTED) {
		/* Turn on GREEN led */
		TM_DISCO_LedOn (LED_GREEN);
		TM_DISCO_LedOff (LED_RED);

		uint8_t readCharacter;

		if (TM_USB_VCP_Getc(&readCharacter) == TM_USB_VCP_DATA_OK) {
			//TM_USB_VCP_Putc(c);
			return readCharacter;
		}
	} else {
		/* USB not OK */
		TM_DISCO_LedOff (LED_GREEN);
		TM_DISCO_LedOn (LED_RED);

		return 0;
	}
	return 0;
}

void processReceivedData(uint8_t *receivedData, int *mainState) {
	switch (receivedData[0]) {
	case COMMAND_MOVE:
		setState(mainState, MAIN_MOVE);
		break;
	default:
		break;
	}
}

void fillDummiesBuffers() {
	for (int i = 0; i < MAX_WHEEL_INDEX; i++) {
		bufferWheel1[i] = i + 1;
		bufferWheel2[i] = i + 2;
		bufferWheel3[i] = i + 3;
		bufferWheel4[i] = i + 4;
	}
}

int main(void) {
	/* System Init */
	SystemInit();

// Motors initialization
	initMotors();

// Encoder initialization
	initEncoders();
// LCD initialization
	TM_HD44780_Init(16, 2);

	/* Initialize LED's. Make sure to check settings for your board in tm_stm32f4_disco.h file */
	TM_DISCO_LedInit();

	/* Initialize USB VCP */
	TM_USB_VCP_Init();

	initBtn();

//Initialize Systick timer
	TM_DELAY_Init();

// Initialisation des variables
	int mainState = MAIN_ACQUIS_ALL;
//setState(&mainState, MAIN_MOVE);

	int state = IDLE;
	char stateInput = 0;
// initializations for manchester signal
	InitializeLEDs();
	InitializeManchesterInput();
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
	initializeExternalInterruptLine4();

	float consigneX;
	float consigneY;

	while (1) {

		// Vite fait debounce pour le bouton bleu
		if (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0)) {
			int i;
			for (i = 0; i < 9000000; i++)
				;
			TM_DISCO_LedOn (LED_BLUE);
			switch (mainState) {
			case MAIN_IDLE:
				mainState = MAIN_PID;
				//setState(&mainState, MAIN_MOVE);
				break;
			}
		}
		char receivedData[MAXIMUM_CHARACTERS_BUFFER_SIZE];
		if (readUSB() == 1) {
			setState(&mainState, MAIN_PID);
		}

		/* Main state machine */
		switch (mainState) {
		case MAIN_IDLE:
			//if (consigne != 0)
			//setState(&mainState, consigne);
			break;
		case MAIN_ACQUIS:
			/* Action lors d'une acquisition */
			stateInput = readUSB();
			if (stateInput != 0)
				state = stateInput;

			if (state == GENERATE_FIRST_PWM) {
				generateFirstPWM();
				state = BETWEEN_PWM;
			} else if (state == ACQUIRE) {
				startFillingBuffer();
				state = WAIT_FOR_SECOND_PWM;
			} else if (state == SEND_DATA) {
				for (int i = 0; i < TAILLE; i++) {
					TM_USB_VCP_Putc(speedBuffer[i] & 0x00ff);
					TM_USB_VCP_Putc((speedBuffer[i] & 0xff00) >> 8);
				}
				state = IDLE;
			} else if (state == WAIT_FOR_SECOND_PWM && speedIndex > 200) {
				generateSecondPWM();
				state = IDLE;
			}
			break;
		case MAIN_ACQUIS_ALL:
			/***** Motor 1 *****/
			// Seulement le moteur 1 opérationnel
			MotorSetDirection(1, CLOCK);
			MotorSetDirection(2, BRAKE_G);
			MotorSetDirection(3, BRAKE_G);
			MotorSetDirection(4, BRAKE_G);
			// Pour débuter le remplissage du buffer
			bufferWheelIndex1 = 0;
			// Première vitesse du moteur
			MotorSetSpeed(1, PREMIER_ECHELON);
			// Délai avant le prochain PWM
			Delayms(DUREE_ECHELON_1);
			MotorSetSpeed(1, DEUXIEME_ECHELON);
			// Délai de la fin de l'asservissement
			Delayms(DUREE_ECHELON_2);
			/***** Motor 2 *****/
			MotorSetDirection(1, BRAKE_G);
			MotorSetDirection(2, CLOCK);
			MotorSetSpeed(1, 0);
			// Pour débuter le remplissage du buffer
			bufferWheelIndex2 = 0;
			MotorSetSpeed(2, PREMIER_ECHELON);
			// Delai du 1er échelon
			Delayms(DUREE_ECHELON_1);
			// 2e échelon
			MotorSetSpeed(2, DEUXIEME_ECHELON);
			Delayms(DUREE_ECHELON_2);
			/***** Motor 3 *****/
			MotorSetDirection(2, BRAKE_G);
			MotorSetDirection(3, CLOCK);
			MotorSetSpeed(2, 0);
			// Pour débuter le remplissage du buffer
			bufferWheelIndex3 = 0;
			MotorSetSpeed(3, PREMIER_ECHELON);
			// Delai du 1er échelon
			Delayms(DUREE_ECHELON_1);
			// 2e échelon
			MotorSetSpeed(3, DEUXIEME_ECHELON);
			Delayms(DUREE_ECHELON_2);
			/***** Motor 4 *****/
			MotorSetDirection(3, BRAKE_G);
			MotorSetDirection(4, CLOCK);
			MotorSetSpeed(3, 0);
			// Pour débuter le remplissage du buffer
			bufferWheelIndex4 = 0;
			MotorSetSpeed(4, PREMIER_ECHELON);
			// Delai du 1er échelon
			Delayms(DUREE_ECHELON_1);
			// 2e échelon
			MotorSetSpeed(4, DEUXIEME_ECHELON);
			Delayms(DUREE_ECHELON_2);
			// On stop le moteur
			MotorSetSpeed(4, 0);

			//fillDummiesBuffers();

			/****** ENVOIE DONNÉES MOTEUR 1 ******/
			// On attends que l'ordinateur demande des données
			char cmdAcquis = 0;
			while (cmdAcquis == 0) {
				cmdAcquis = readUSB();
			}
			VCP_DataTx((uint8_t*) bufferWheel1, MAX_WHEEL_INDEX * 2);
			/****** ENVOIE DONNÉES MOTEUR 2 ******/
			cmdAcquis = 0;
			while (cmdAcquis == 0) {
				cmdAcquis = readUSB();
			}
			VCP_DataTx((uint8_t*) bufferWheel2, MAX_WHEEL_INDEX * 2);
			/****** ENVOIE DONNÉES MOTEUR 3 ******/
			cmdAcquis = 0;
			while (cmdAcquis == 0) {
				cmdAcquis = readUSB();
			}
			VCP_DataTx((uint8_t*) bufferWheel3, MAX_WHEEL_INDEX * 2);
			/****** ENVOIE DONNÉES MOTEUR 4 ******/
			cmdAcquis = 0;
			while (cmdAcquis == 0) {
				cmdAcquis = readUSB();
			}
			VCP_DataTx((uint8_t*) bufferWheel4, MAX_WHEEL_INDEX * 2);

			break;
		case MAIN_TEST_SPEED_PID:
			/* Initialization of wheel 1 PIDs */
			PID_init(&PID_SPEED1, PID_SPEED1_KP, PID_SPEED1_KI, PID_SPEED1_KD,
					PID_Direction_Direct);
			PID_SetOutputLimits(&PID_SPEED1, MIN_SPEED_COMMAND,
					MAX_SPEED_COMMAND);

			break;
		case MAIN_DEAD_ZONE:
			// On fait tourner tous les moteurs dans la même direction
			MotorSetDirection(1, CLOCK);
			MotorSetDirection(2, CLOCK);
			MotorSetDirection(3, CLOCK);
			MotorSetDirection(4, CLOCK);
			// On fait passer les vitesses de moteurs par toute les PWM
			for (int i = DEAD_START_PWM; i <= DEAD_STOP_PWM; i++) {
				MotorSetSpeed(1, i);
				MotorSetSpeed(2, i);
				MotorSetSpeed(3, i);
				MotorSetSpeed(4, i);
				// On change l'index pour que dans l'interruption
				// ce soit le bon qui soit rempli
				bufferDeadZoneIndex1 = i;
				bufferDeadZoneIndex2 = i;
				bufferDeadZoneIndex3 = i;
				bufferDeadZoneIndex4 = i;
				// On attends un peu pour avoir une valeue représentative
				Delayms(100);
			}
			// On attends que l'ordinateur demande des données
			char cmdDeadZone = 0;
			while (cmdDeadZone == 0) {
				cmdDeadZone = readUSB();
			}
			VCP_DataTx((uint8_t*) bufferDeadZone1, MAX_DEAD_ZONE * 2);
			break;
		case MAIN_MOVE:
			motorRoutine();
			break;
		case MAIN_PID:
			consigneX = 0.24;
			consigneY = 0.24;

