JBHarvey/design-iii/src/stm32/dev/src/main.c
			/* Initialization of wheel 1 PIDs */
			PID_init(&PID_SPEED1, PID_SPEED_KP, PID_SPEED_KI, PID_SPEED_KD,
					PID_Direction_Direct);
			PID_SetOutputLimits(&PID_SPEED1, MIN_SPEED_COMMAND,
					MAX_SPEED_COMMAND);
			PID_init(&PID_POSITION1, PID_POSITION_KP, PID_POSITION_KI,
					PID_POSITION_KD, PID_Direction_Direct);
			PID_SetOutputLimits(&PID_POSITION1, MIN_POS_COMMAND,
					MAX_POS_COMMAND);

			/* Initialization of wheel 2 PIDs */
			PID_init(&PID_SPEED2, PID_SPEED_KP, PID_SPEED_KI, PID_SPEED_KD,
					PID_Direction_Direct);
			PID_SetOutputLimits(&PID_SPEED2, MIN_SPEED_COMMAND,
					MAX_SPEED_COMMAND);
			PID_init(&PID_POSITION2, PID_POSITION_KP, PID_POSITION_KI,
					PID_POSITION_KD, PID_Direction_Direct);

			/* Initialization of wheel 3 PIDs */
			PID_init(&PID_SPEED3, PID_SPEED_KP, PID_SPEED_KI, PID_SPEED_KD,
					PID_Direction_Direct);
			PID_SetOutputLimits(&PID_SPEED3, MIN_SPEED_COMMAND,
					MAX_SPEED_COMMAND);
			PID_init(&PID_POSITION3, PID_POSITION_KP, PID_POSITION_KI,
					PID_POSITION_KD, PID_Direction_Direct);

			/* Initialization of wheel 4 PIDs */
			PID_init(&PID_SPEED4, PID_SPEED_KP, PID_SPEED_KI, PID_SPEED_KD,
					PID_Direction_Direct);
			PID_SetOutputLimits(&PID_SPEED4, MIN_SPEED_COMMAND,
					MAX_SPEED_COMMAND);
			PID_init(&PID_POSITION4, PID_POSITION_KP, PID_POSITION_KI,
					PID_POSITION_KD, PID_Direction_Direct);

			PID_POSITION1.mySetpoint = 1;
			PID_POSITION2.mySetpoint = 1;
			PID_POSITION3.mySetpoint = 1;
			PID_POSITION4.mySetpoint = 1;

			while (1) {

				if (consigneY > 0) {
					MotorSetDirection(2, COUNTER_CLOCK);
					MotorSetDirection(4, CLOCK);
				} else if (consigneY < 0) {
					MotorSetDirection(2, CLOCK);
					MotorSetDirection(4, COUNTER_CLOCK);
				} else {
					MotorSetDirection(2, BRAKE_G);
					MotorSetDirection(4, BRAKE_G);
				}

				if (PID_Compute_Position(&PID_POSITION1)) {
					float positionOutput = PID_POSITION1.myOutput;
					PID_SPEED1.mySetpoint = positionOutput;

					if (PID_Compute_Speed(&PID_SPEED1)) {
						int cmdMotor1 = PID_SPEED1.myOutput;
						if (cmdMotor1 > 0) {
							speedDirection1 = SPEED_DIRECTION_FORWARD;
							MotorSetDirection(1, CLOCK);
							//MotorSetDirection(3, CLOCK);
						} else if (cmdMotor1 < 0) {

							speedDirection1 = SPEED_DIRECTION_BACKWARD;
							MotorSetDirection(1, COUNTER_CLOCK);
							//MotorSetDirection(3, COUNTER_CLOCK);
							cmdMotor1 = -cmdMotor1;
						} else {
							speedDirection1 = SPEED_DIRECTION_NONE;
							MotorSetDirection(1, BRAKE_G);
							//MotorSetDirection(3, BRAKE_G);

						}
						MotorSetSpeed(1, cmdMotor1);
						PID_SetMode(&PID_SPEED1, PID_Mode_Manual);

						char numberString[MAX_DISPLAY_CHARACTERS];
						sprintf(numberString, "%d", numberOfSpeedEdges1);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(0, 0, numberString);
						sprintf(numberString, "%d", cmdMotor1);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(3, 0, numberString);

						/* send position to USB */
						TM_USB_VCP_Putc(2);
						TM_USB_VCP_Putc(8);
						VCP_DataTx((uint8_t*) &positionOutput, sizeof(float));
						VCP_DataTx((uint8_t*) &positionOutput, sizeof(float));

					}
				}

				if (PID_Compute_Position(&PID_POSITION2)) {
					float positionOutput = PID_POSITION2.myOutput;
					PID_SPEED2.mySetpoint = positionOutput;

					if (PID_Compute_Speed(&PID_SPEED2)) {
						int cmdMotor2 = PID_SPEED2.myOutput;
						if (cmdMotor2 > 0) {
							speedDirection2 = SPEED_DIRECTION_FORWARD;
							MotorSetDirection(2, CLOCK);
							//MotorSetDirection(4, CLOCK);
						} else if (cmdMotor2 < 0) {

							speedDirection2 = SPEED_DIRECTION_BACKWARD;
							MotorSetDirection(2, COUNTER_CLOCK);
							//MotorSetDirection(4, CLOCK);
							cmdMotor2 = -cmdMotor2;
						} else {
							speedDirection2 = SPEED_DIRECTION_NONE;
							MotorSetDirection(2, BRAKE_G);
							//MotorSetDirection(4, BRAKE_G);

						}
						MotorSetSpeed(2, cmdMotor2);
						PID_SetMode(&PID_SPEED2, PID_Mode_Manual);

						char numberString[MAX_DISPLAY_CHARACTERS];
						sprintf(numberString, "%d", numberOfSpeedEdges2);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(0, 0, numberString);
						sprintf(numberString, "%d", cmdMotor2);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(3, 0, numberString);
					}
				}

				if (PID_Compute_Position(&PID_POSITION3)) {
					float positionOutput = PID_POSITION3.myOutput;
					PID_SPEED3.mySetpoint = positionOutput;

					if (PID_Compute_Speed(&PID_SPEED3)) {
						int cmdMotor3 = PID_SPEED3.myOutput;
						if (cmdMotor3 > 0) {
							speedDirection3 = SPEED_DIRECTION_FORWARD;
							MotorSetDirection(3, COUNTER_CLOCK);
							//MotorSetDirection(1, COUNTER_CLOCK);
						} else if (cmdMotor3 < 0) {

							speedDirection3 = SPEED_DIRECTION_BACKWARD;
							MotorSetDirection(3, CLOCK);
							//MotorSetDirection(1, CLOCK);
							cmdMotor3 = -cmdMotor3;
						} else {
							speedDirection3 = SPEED_DIRECTION_NONE;
							MotorSetDirection(3, BRAKE_G);
							//MotorSetDirection(1, BRAKE_G);

						}
						MotorSetSpeed(3, cmdMotor3);
						PID_SetMode(&PID_SPEED3, PID_Mode_Manual);

						char numberString[MAX_DISPLAY_CHARACTERS];
						sprintf(numberString, "%d", numberOfSpeedEdges3);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(0, 0, numberString);
						sprintf(numberString, "%d", cmdMotor3);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(3, 0, numberString);
					}
				}
				if (PID_Compute_Position(&PID_POSITION4)) {
					float positionOutput = PID_POSITION4.myOutput;
					PID_SPEED4.mySetpoint = positionOutput;

					if (PID_Compute_Speed(&PID_SPEED4)) {
						int cmdMotor4 = PID_SPEED4.myOutput;
						if (cmdMotor4 > 0) {
							speedDirection4 = SPEED_DIRECTION_FORWARD;
							MotorSetDirection(4, COUNTER_CLOCK);
							//MotorSetDirection(2, COUNTER_CLOCK);
						} else if (cmdMotor4 < 0) {

							speedDirection4 = SPEED_DIRECTION_BACKWARD;
							MotorSetDirection(4, CLOCK);
							//MotorSetDirection(2, CLOCK);
							cmdMotor4 = -cmdMotor4;
						} else {
							speedDirection4 = SPEED_DIRECTION_NONE;
							MotorSetDirection(4, BRAKE_G);
							//MotorSetDirection(2, BRAKE_G);

